C03/Nz25/Nz25_ref/0.orig/p_rgh
/*------------------------*- C++ -*--------------------------*\
| ========= | |
| \\ / F ield | OpenFOAM: The Open Source CFD Toolbox |
| \\ / O peration | Version: 2.1.1 |
| \\ / A nd | Web: www.OpenFOAM.org |
| \\/ M anipulation | |
\*------------------------------------------------------------*/
FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 object p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions [1 -1 -2 0 0 0 0];
internalField uniform 0;
boundaryField
{
	inlet_water
 	{
 		type fixedFluxPressure;
		value uniform 0;
 	}
	
	inlet_air
 	{
 		type fixedFluxPressure;
		value uniform 0;
 	}
 
	outlet_water
 	{
 		type fixedFluxPressure;
		value uniform 0;
	}
 	outlet_air
 	{
 		type fixedFluxPressure;
		value uniform 0;
	}

 	lowerWall
 	{
 		type fixedFluxPressure;
		value uniform 0;
 	}
 	atmosphere
	{
 		type totalPressure;
		p0 uniform 0;
		value uniform 0;
 	}
 	defaultFaces
 	{
 	type empty;
	}
}
// ********************************************************** //
